In [4]:
import pandas as pd
amazon=[1,2,3]
flipcart=pd.Series(amazon)
print(flipcart)

0    1
1    2
2    3
dtype: int64

In [5]:
import pandas as pd
amazon=[1,2,3]
flipcart=pd.Series(amazon,index=["x","y","z"])
print(flipcart)

x    1
y    2
z    3
dtype: int64

In [10]:
#creating data set

import pandas as pd
shopsy={
    'Item':["bodywear","accesories","electronic gadgets"],
    'In stock':[55,34,55]
}
business=pd.DataFrame(shopsy)
print(business)

                 Item  In stock
0            bodywear        55
1          accesories        34
2  electronic gadgets        55

In [19]:
import pandas as pd
shopsy={
    'Item':["causals","frocks","tshirts","chudidhars"],
    'In stock':[55,34,55,78],
    'gender':["kids","girls","men","women"]
}
df=pd.DataFrame(shopsy)
print(df)

         Item  In stock gender
0     causals        55   kids
1      frocks        34  girls
2     tshirts        55    men
3  chudidhars        78  women

In [20]:
df

         Item  In stock gender
0     causals        55   kids
1      frocks        34  girls
2     tshirts        55    men
3  chudidhars        78  women

In [21]:
df.columns

Index(['Item', 'In stock', 'gender'], dtype='object')

In [22]:
df.shape

(4, 3)

In [23]:
df.info

<bound method DataFrame.info of          Item  In stock gender
0     causals        55   kids
1      frocks        34  girls
2     tshirts        55    men
3  chudidhars        78  women>

In [27]:
import pandas as pd
shopsy={
    'Item':["causals","frocks","tshirts","chudidhars","westrenwear","formals","ethinic wear","jackets","shervaani","kurtas"],
    'In stock':[55,34,55,78,87,55,22,33,11,77],
    'gender':["kids","girls","men","women","boys","men","kids","men","ladies","boys"],
    'startingprice':[4000,10000,500,20000,8000,23333,6999,2222,77777,88888]
}
df=pd.DataFrame(shopsy)
print(df)

           Item  In stock  gender  startingprice
0       causals        55    kids           4000
1        frocks        34   girls          10000
2       tshirts        55     men            500
3    chudidhars        78   women          20000
4   westrenwear        87    boys           8000
5       formals        55     men          23333
6  ethinic wear        22    kids           6999
7       jackets        33     men           2222
8     shervaani        11  ladies          77777
9        kurtas        77    boys          88888

In [28]:
df

           Item  In stock  gender  startingprice
0       causals        55    kids           4000
1        frocks        34   girls          10000
2       tshirts        55     men            500
3    chudidhars        78   women          20000
4   westrenwear        87    boys           8000
5       formals        55     men          23333
6  ethinic wear        22    kids           6999
7       jackets        33     men           2222
8     shervaani        11  ladies          77777
9        kurtas        77    boys          88888

In [29]:
df.shape

(10, 4)

In [30]:
df.head()

          Item  In stock gender  startingprice
0      causals        55   kids           4000
1       frocks        34  girls          10000
2      tshirts        55    men            500
3   chudidhars        78  women          20000
4  westrenwear        87   boys           8000

In [31]:
df.head(6)

          Item  In stock gender  startingprice
0      causals        55   kids           4000
1       frocks        34  girls          10000
2      tshirts        55    men            500
3   chudidhars        78  women          20000
4  westrenwear        87   boys           8000
5      formals        55    men          23333

In [32]:
df.tail()

           Item  In stock  gender  startingprice
5       formals        55     men          23333
6  ethinic wear        22    kids           6999
7       jackets        33     men           2222
8     shervaani        11  ladies          77777
9        kurtas        77    boys          88888

In [33]:
df.tail(2)

        Item  In stock  gender  startingprice
8  shervaani        11  ladies          77777
9     kurtas        77    boys          88888

In [35]:
df[["Item","gender"]]

           Item  gender
0       causals    kids
1        frocks   girls
2       tshirts     men
3    chudidhars   women
4   westrenwear    boys
5       formals     men
6  ethinic wear    kids
7       jackets     men
8     shervaani  ladies
9        kurtas    boys

In [38]:
df["gender"].value_counts()

gender
men       3
kids      2
boys      2
girls     1
women     1
ladies    1
Name: count, dtype: int64

In [44]:
df["startingprice"].value_counts().sort_values()

startingprice
4000     1
10000    1
500      1
20000    1
8000     1
23333    1
6999     1
2222     1
77777    1
88888    1
Name: count, dtype: int64

In [47]:
df["startingprice"].value_counts().sort_values(ascending=False)

startingprice
4000     1
10000    1
500      1
20000    1
8000     1
23333    1
6999     1
2222     1
77777    1
88888    1
Name: count, dtype: int64

In [49]:
df

           Item  In stock  gender  startingprice
0       causals        55    kids           4000
1        frocks        34   girls          10000
2       tshirts        55     men            500
3    chudidhars        78   women          20000
4   westrenwear        87    boys           8000
5       formals        55     men          23333
6  ethinic wear        22    kids           6999
7       jackets        33     men           2222
8     shervaani        11  ladies          77777
9        kurtas        77    boys          88888

In [48]:
print(df.loc[0])

Item             causals
In stock              55
gender              kids
startingprice       4000
Name: 0, dtype: object

In [53]:
df=pd.read_csv(r'C:\Users\sairam\Desktop\m@noj\python1.csv')

In [55]:
df.head(10)

,ROLL NO,STUDENT NAME,HINDI,ENGLISH,MATH,PHYSICS,CHEMISSTRY,TOTAL,AVERAGE,GRADE
0,1.0,RAM,20.0,10,14.0,18,15.0,77.0,15.4,A
1,2.0,ASHOK,21.0,12,14.0,12,18.0,77.0,15.4,A
2,3.0,MANOJ,33.0,15,7.0,14,17.0,86.0,17.2,A
3,4.0,RAJESH,15.0,14,8.0,16,10.0,63.0,12.6,B
4,5.0,RANJANA,14.0,17,10.0,13,18.0,72.0,14.4,B
5,6.0,POOJA,16.0,8,20.0,17,15.0,76.0,15.2,A
6,7.0,MAHESH,18.0,19,3.0,10,14.0,64.0,12.8,B
7,8.0,ASHUTOOSH,19.0,20,7.0,14,18.0,78.0,15.6,A
8,9.0,ANIK,22.0,13,8.0,12,19.0,74.0,14.8,B
9,10.0,PREM,26.0,13,10.0,11,17.0,77.0,15.4,A